In [1]:
import pandas as pd

# Load Data

In [2]:
df_applications = pd.read_csv('../data/raw/application_record.csv')
df_credit = pd.read_csv('../data/raw/credit_record.csv')

# Explore applications dataset

In [3]:
df_applications.columns

Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'DAYS_EMPLOYED', 'FLAG_MOBIL', 'FLAG_WORK_PHONE', 'FLAG_PHONE',
       'FLAG_EMAIL', 'OCCUPATION_TYPE', 'CNT_FAM_MEMBERS'],
      dtype='object')

In [4]:
df_applications['FLAG_EMAIL'].value_counts()

0    391102
1     47455
Name: FLAG_EMAIL, dtype: int64

In [5]:
df_applications.sample(5)

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
338589,6394490,F,N,Y,0,225000.0,Working,Secondary / secondary special,Widow,Co-op apartment,-16590,-1247,1,0,0,0,NaN,1.0
171381,5807344,F,Y,Y,1,202500.0,Commercial associate,Higher education,Married,House / apartment,-11460,-1268,1,0,0,1,Waiters/barmen staff,3.0
307604,6229139,F,N,Y,1,157500.0,Working,Secondary / secondary special,Married,House / apartment,-8712,-723,1,1,0,0,Sales staff,3.0
346477,6424137,F,N,Y,0,72000.0,State servant,Secondary / secondary special,Married,House / apartment,-21001,-2277,1,1,0,0,Laborers,2.0
11195,5036291,F,N,Y,0,135000.0,State servant,Secondary / secondary special,Separated,House / apartment,-17999,-5700,1,0,1,0,Laborers,1.0

In [6]:
df_applications.describe()

,ID,CNT_CHILDREN,AMT_INCOME_TOTAL,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,CNT_FAM_MEMBERS
count,4.385570e+05,438557.000000,4.385570e+05,438557.000000,438557.000000,438557.0,438557.000000,438557.000000,438557.000000,438557.000000
mean,6.022176e+06,0.427390,1.875243e+05,-15997.904649,60563.675328,1.0,0.206133,0.287771,0.108207,2.194465
std,5.716370e+05,0.724882,1.100869e+05,4185.030007,138767.799647,0.0,0.404527,0.452724,0.310642,0.897207
min,5.008804e+06,0.000000,2.610000e+04,-25201.000000,-17531.000000,1.0,0.000000,0.000000,0.000000,1.000000
25%,5.609375e+06,0.000000,1.215000e+05,-19483.000000,-3103.000000,1.0,0.000000,0.000000,0.000000,2.000000
50%,6.047745e+06,0.000000,1.607805e+05,-15630.000000,-1467.000000,1.0,0.000000,0.000000,0.000000,2.000000
75%,6.456971e+06,1.000000,2.250000e+05,-12514.000000,-371.000000,1.0,0.000000,1.000000,0.000000,3.000000
max,7.999952e+06,19.000000,6.750000e+06,-7489.000000,365243.000000,1.0,1.000000,1.000000,1.000000,20.000000

In [ ]:
df_applications.isnull().any()

# Explore credit dataset

In [7]:
df_credit.sample(3)

             ID  MONTHS_BALANCE STATUS
378812  5045110             -38      0
783226  5113661              -3      0
11510   5002239             -45      C

In [8]:
df_credit['STATUS'].value_counts()

C    442031
0    383120
X    209230
1     11090
5      1693
2       868
3       320
4       223
Name: STATUS, dtype: int64

In [9]:
df_credit.describe()

                 ID  MONTHS_BALANCE
count  1.048575e+06    1.048575e+06
mean   5.068286e+06   -1.913700e+01
std    4.615058e+04    1.402350e+01
min    5.001711e+06   -6.000000e+01
25%    5.023644e+06   -2.900000e+01
50%    5.062104e+06   -1.700000e+01
75%    5.113856e+06   -7.000000e+00
max    5.150487e+06    0.000000e+00

# Sandbox